Section_4_Real_Workload_Validation/Experiment13/data/raw/case-C/sustained-ramp/trial_012/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 30.478ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 30.623ms, rate sampling interval: 59ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.36ms    5.63ms 126.66ms   95.77%
    Req/Sec   150.71     57.68   372.00     69.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.28ms
 75.000%   29.17ms
 90.000%   31.28ms
 99.000%   54.27ms
 99.900%   95.23ms
 99.990%  120.96ms
 99.999%  123.84ms
100.000%  126.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      23.199     0.000000            1         1.00
      25.199     0.100000         5237         1.11
      25.743     0.200000        10303         1.25
      26.223     0.300000        15380         1.43
      26.719     0.400000        20534         1.67
      27.279     0.500000        25615         2.00
      27.599     0.550000        28134         2.22
      27.935     0.600000        30642         2.50
      28.303     0.650000        33199         2.86
      28.703     0.700000        35756         3.33
      29.167     0.750000        38286         4.00
      29.423     0.775000        39568         4.44
      29.727     0.800000        40825         5.00
      30.031     0.825000        42084         5.71
      30.383     0.850000        43336         6.67
      30.783     0.875000        44615         8.00
      31.023     0.887500        45244         8.89
      31.279     0.900000        45867        10.00
      31.599     0.912500        46525        11.43
      31.983     0.925000        47159        13.33
      32.495     0.937500        47780        16.00
      32.831     0.943750        48102        17.78
      33.279     0.950000        48417        20.00
      33.887     0.956250        48738        22.86
      34.591     0.962500        49054        26.67
      35.519     0.968750        49371        32.00
      36.191     0.971875        49531        35.56
      37.343     0.975000        49688        40.00
      39.039     0.978125        49847        45.71
      40.831     0.981250        50005        53.33
      44.063     0.984375        50166        64.00
      47.359     0.985938        50245        71.11
      49.599     0.987500        50323        80.00
      52.895     0.989062        50403        91.43
      55.743     0.990625        50483       106.67
      58.527     0.992188        50562       128.00
      60.415     0.992969        50603       142.22
      62.431     0.993750        50642       160.00
      65.439     0.994531        50682       182.86
      69.183     0.995313        50722       213.33
      73.279     0.996094        50761       256.00
      75.391     0.996484        50781       284.44
      78.015     0.996875        50801       320.00
      79.743     0.997266        50821       365.71
      83.071     0.997656        50841       426.67
      86.911     0.998047        50861       512.00
      87.935     0.998242        50872       568.89
      88.895     0.998437        50881       640.00
      91.135     0.998633        50891       731.43
      92.671     0.998828        50901       853.33
      95.551     0.999023        50911      1024.00
      98.303     0.999121        50916      1137.78
     100.415     0.999219        50921      1280.00
     104.575     0.999316        50926      1462.86
     105.407     0.999414        50931      1706.67
     109.823     0.999512        50936      2048.00
     110.399     0.999561        50938      2275.56
     110.975     0.999609        50941      2560.00
     112.767     0.999658        50943      2925.71
     115.263     0.999707        50946      3413.33
     115.775     0.999756        50948      4096.00
     115.839     0.999780        50949      4551.11
     116.991     0.999805        50951      5120.00
     117.439     0.999829        50952      5851.43
     118.783     0.999854        50953      6826.67
     119.359     0.999878        50954      8192.00
     120.959     0.999890        50955      9102.22
     121.087     0.999902        50956     10240.00
     121.087     0.999915        50956     11702.86
     121.855     0.999927        50957     13653.33
     121.855     0.999939        50957     16384.00
     122.495     0.999945        50958     18204.44
     122.495     0.999951        50958     20480.00
     122.495     0.999957        50958     23405.71
     123.839     0.999963        50959     27306.67
     123.839     0.999969        50959     32768.00
     123.839     0.999973        50959     36408.89
     123.839     0.999976        50959     40960.00
     123.839     0.999979        50959     46811.43
     126.719     0.999982        50960     54613.33
     126.719     1.000000        50960          inf
#[Mean    =       28.356, StdDeviation   =        5.632]
#[Max     =      126.656, Total count    =        50960]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  54002 requests in 3.00m, 43.93MB read
Requests/sec:    299.96
Transfer/sec:    249.87KB